InformationRegisters/ОчередьСклоненийФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСклоненийФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СклонениеФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СклонениеФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИзмененоВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Именительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Творительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предолжный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дательный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьСклоненийФИО/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция Создать() Экспорт

	Возврат СоздатьНаборЗаписей();

КонецФункции // ()

Процедура Просклонять() Экспорт

	Блокировка = Новый БлокировкаДанных;
	ТаблицаБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСклоненийФИО");
	
	ТаблицаБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Контрагенты = Новый Массив;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
	
		Блокировка.Заблокировать();
		
		Контрагенты = ПолучитьКонтрагентов();
		ОчиститьВсе();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		Контрагенты = Новый Массив;
	КонецПопытки;
	
	Если Контрагенты.Количество() = 0 Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ВычислитьПадежи(Контрагенты);

КонецПроцедуры

Функция Пустая() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции // ()

Функция ПолучитьВсех() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции // ()

Функция ПолучитьКонтрагентов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьСклоненийФИО.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.ОчередьСклоненийФИО КАК ОчередьСклоненийФИО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьВсе()

	Записи = СоздатьНаборЗаписей();
	Записи.Записать();

КонецПроцедуры

Процедура ВычислитьПадежи(Контрагенты)

	Для каждого Контрагент Из Контрагенты Цикл
	
		РегистрыСведений.СклонениеФИО.ЗаполнитьСклонения(Контрагент);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
